request.xml

<?xml version="1.0" encoding="utf-8"?>
    <soapenv:Envelope xmlns="@NAMESPACE@" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
        <soapenv:Header>
            <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                    <wsse:Username>@USERNAME@</wsse:Username>
                    <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">@PASSWORD@</wsse:Password>
                    <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">@NONCE@</wsse:Nonce>
                    <wsu:Created>@CREATED@</wsu:Created>
                </wsse:UsernameToken>
            </wsse:Security>
        </soapenv:Header>
        <soapenv:Body>
<CartAddRequest>
@CART_ID@
	<order>
		<onlineService id="test" name="Test Service" notify="@NOTIFY_URI@?serviceId=@SERVICE_ID@" prev="@CURRENT_URI@" next="@CURRENT_URI@"/>
		<orderline id="orderline id">
			<product title="Test product"
				ref="reference" cost="123" gst="45"
				agency="Test agency"
				description="Test product description"
				disbursementId="999">
				<accounting costCenter="ABC" glCode="A-2A-123" taxCode="FT" narrative="Test narrative"/>
				<distribution title="Test download">
					<resource link="@DOWNLOAD_URI@?serviceId=@SERVICE_ID@" type="Test download" size="1 kb" />
				</distribution>
			</product>
		</orderline>
	</order>
</CartAddRequest>
</soapenv:Body></soapenv:Envelope>